#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-qse5aD4zAzMU41Ac

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_iam_user.schutzbot_webhook_sqs: Refreshing state... [id=schutzbot_webhook_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_sqs_queue.schutzbot_webhook_sqs: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/schutzbot_webhook_sqs-staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_sqs_queue_policy.test: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/schutzbot_webhook_sqs-staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_policy.schutzbot_webhook_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/schutzbot_webhook_sqs_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_user_policy_attachment.schutzbot_webhook_sqs: Refreshing state... [id=schutzbot_webhook_staging-20210209202243620200000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-01651541b6ae90160]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0236ce4e3ed3355c7]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-652200567]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-4f2febf1-e208-45df-b1ae-ec99e390367c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-622835329]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-3ad4c7b3-c385-4829-a6e3-c8cac094dfd8]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.rpmrepo_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "rpmrepo_s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]

          + condition {
              + test     = "ArnNotEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceVpce"
            }
        }
    }

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "2469776133" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZaY/iyrn+jnT+gy8Z6SaaAF6Abjqnj4LBZrXBZZeNnRuhsl1g4/LSdpltzvz3K7N0enp6ThLlSlenv0BVvVs971r0IE0oTmjDOGX4iYlLQsMM5bQVh0fs/4Vx0zLxUX56risTRRIXUB32gV2vVauGifMiTJMnhmuyP9V+qjUab4l+qt1lD8MiS4uQXmgRpcgLYpzQvzCbkOAExfi5HiYhbXqbbf0fXEaOkmKD84aUeKkfJtsn5sEN6RuCi8kUH2nLI2npN7w02YTbn2pKGOPvjPvDW5parSxwXjzVGKbBVBY8MdjjG9VmjWEYpiiCNSppkObhGfvrCJ8utNVfg6kXRdDIC8T0+/2+KKhnNOBOHi9Vy2Ff64v9fn/Q1wbH3UaeTMhoM0h6oUfGp9jKJTE3IE/mXRrpI4PD2YM/WJ4P3M7uWkmgkeVKyfAyD9WjuiKjR89a9FpAzkSfPffkg3r6HG22QW9TnlS73Zt8VlB3cTJMcdsJ1FQ+bsBq1AnH1GvpGklcSQ5nmR61SZilbc2hIo23/ZdtpPe7w3Nw2rrdsqP0wqMxObYtcVfqCjtaaWd1l+HNKbTKz8UEfA54mGvRrC+W5cTW3HxHPsuBGaP5Pt+fjAVfFgu6T2xxF7jLw2nxwFvLHcpmfqsXGOhlKXEH+dSFMp+svPZye2C3oeZ2i9CVjfODauCjJXS03uNLpi0sxZ552dbJiY7G45mjKwE9Lx4U38kXcxmuUp3r4/6pvQ2op+YL0SBuR98vH4TzmX0Rgcx7g0V7wR6yzuHwsgz2Bz6hrpAZ8yX1MZ1+NjustkyyZHXS9cTJ+LN88DDPuatj9yEJeiQJ5rmz3eEHL9WSZV8+tjwidCV9etqG5dITD58j7tEuia2s4AsSaXSYziOwG2Y7Y8XjjjLluunwoZiOvXbL6kSnzXzvK4UZ+C/cYDUemeYiO6dbl+11TDtkwUrOEge0OGxuBy3w2TJP1N7Yj2y+MRee30/5kbNJpp2zDeBqOu0pToSS41GQHuAijKSp2ivgjmfZc3dwOrGTzeTFcKec2Nk8bHwBeSCft4eeDX150uLEk2p1ZW734Dlhf7SYzlT3vJJZQ6CbxyOLOe35mYnRLs3/mmM/QLTppXH923jHPt/pcL1LzA+uMU+c4YRTDalT7U2WIreTSTvryoYYHsdG97CIuqvHZNdyHnC6VDWppbCHWfuxM2NSt/RR+I2y2iEPKV5XFeGWlhmiwRPTonF2Te91VSPWe5QXF8u8axV4Yn69GbrQRTiZD9eDhaJMjOdHwUObR5bFHb7Dt9021948bDrupoMw6wtej+O9xx7X42/cg4WyXOgSuLM/bDpY6Pp+r/3IddgN8touK3SFrtf1hZ7rPnQxjx85f/NeeX89kIDxPNdZOte5AYD+1AjFITCnUIfOVGNlCC5nLB1E3FSHQDIldahZzsphZUGHU9FhiQmHqqbw9lk1xRGMOpzLOyyOlY4xjHgwCqDLA9FnAbBgNne5bIrGzs6IZADgYaYRWfRZ5wWYpqpFZKwZsgmgLPjsMVTYTubIfuFx2VBdOTvXUgV9FOyMiHvRVv7SlMyuYQIHQ04yDXWFRurCWGWif8iqs/Y3Z5G8Mswp8FkzsSCwoClLQJJZP1ZO+k4OTCHIjRHbwWbW1VhVhCwRgCw7ekT3VkRSP1YXg4vN0wGEsuTwvgwlWbrQWr1htdYiWdUSMbdM2dZNVbHPwdyyMhWaJMGJCBZQFRVuOldifwKG4tFeyWd/t53Z5nRnRgqvEqXjRMERQHhE8Gha0qOgDKcA78wz4rNUEbKjMSZjuAsESOz9nFenijU5ejvRxGZm2OwRKZwnmGZ20g4pqw5BbAvp2ViRtiurXZMzHciJiRaRORr54mIsU49kumL1YtsCJzw2dWNAz27kSLpF24rg5fZZnjmmWSqxWiiynw2IyVrD6RhwzhAQXzV4ee9EILdkcwgSc66P/Rm0/JExBmddUpFlqbFPfEuXM6RG7bbP+geFyMgyJh37HHDuSnxRzP4MSk5hSUrbGcnIkLjAkkkIDFHVV8BSJHWiJ6IAWHKwE1K6JoHugJ5BYvLuEOzNEXfC43SPV0HXkwBvRtzSi+Spq2Vtly8Ej5jUHJsRGJky5KYDg/dFBVLOhpxujs1AX4nAPU8jV3COs3P/CGL7rMH2yYSq6LOmqFnywpS4EVj5E2gSaUAcXZF6A40QGUSp4BiOrQjRwRn1Ck/vzWziZHZEMp8HJeT6uRpxg4Xki4ppRvrKBxbkBjaUR/rOJyrZnrEhRi5/mP2AV7zzgpUva2FPgNBRNcgNNMtuf5xXx9cY1baZCJKMV3lCdNbruHI296LJybA4hCT5qEtEwdYxMARieYYngDMZGOYUgkQ9WAlklfFEABwQbBakfrzlAFT3uiyHg/iY+4Zoq7BnOyzgrbE68Ea9kT6e8opEl7p1NFTOnCkr+6COir1OSGKNvdwdZdAcK/vFKju4u0A34yP1xnAPWG5pGHAGrekYDugC7Uzknc0YsM4KSW3BMCYctKi5GE5n7jggeiQXcBVMNP44hCOzDSNVtQ25o676gjnqJIuhONeJz2JT1BZaxkLeV7WkL6imqTvWI6tC2IZSdtKT/hmNyV6Vp+2FOQWApydsqbq+8mMtCngkBKoeO6XHK4Kl93jVIhzYBRRLXHewU1k7SjszNusAKHP6OD3akc95ULVngjyDJoD+oAfcs33yI39lw6gDOWduE6Vtm4GinacLNZF3yJoevR1sOzsg6ZE20xO1MPRHwRurHW8n79UVYO1oWqok4rSV0huE15oMYEeaSKoMCZiCiAw1E8jXWs7O3neK8UI3nvGR4jxBpFlQtA2TbdXNsrTAeTMt3DIkfjPNt+85+8MhkHT9mXvgmwLX7LabHHejsRZgJoG1rs/XM8nW132gPqM8eUKH4qnAXo5pEaMEbXH+VBYNjAra4J56gvDQ4bneQ6/Xu1E9FTjfhx6+zK6NCT8SrPSmQoeiPgCTpTFZqGulr/ZHt7bXV4f/gb7SLbw8zKopv3FjaXhpHKPEb0SaTdLeXb+tG5JygU/tK9J6CSR5snq+Adi4I9o4pHl0m8ffYDecgOcWpl7rhm/jDvhdujQAkqG/XkxSh8vFRDXWEMyfA0qz4qnV+vZmzdebNVGMzmmCDkXlx9bbOeQjld9tNGkak4/Hk79F6S78+22BCEkP2F/7aYzCpGCemb8xdYpR/DZq6n9m6kHpNt0cH97vX7H5/oi5a/AQ88zUP7baQw0vp80MV3PXzbqrwH/bvv8zO94hvcceTfPbx2+hWqRl7uGiuUvLKmj8u156ynCl+b5/H2fx0SOlj9dlEtLLveo3Hbd8qf/9FZIiTKKimZb0vUx0KNaXkfSAqBesSbot7uLDJCvpDa9X1a9g4MTP0jChlZB7KFbcPwzAu9htnpbZunqoVqy3TFnfM+VOVdAco/iV7OqbdXEqSLp9vf/tMd30Uh97F4SKNKnXanmZeLF/Hb2LU0Fx7FHC4AS5BDONRpIemCtSv/HQ/3ee7MdGEWBCrjXjR2/2/2q5YdJyURHUCkyZBi5TJgszvEEhqV1d//ELofYHZoQpQwPMhElBUeJhZjJs1iaqbvTVgbSeDJ8//dErc8I05gVTOeOp1eK6vSbfaTdvny2CKC5oK8YUNXxEUesuqxH6f6p09IsCxxVAQVrQCvdmTYbz+Wtte65/+vJxufva+PTljTFf65W4ZV4FR1peDU/w4Y1c7AUpU9cxpWGyvXno9ZihKfPpyzeqvzYvIvUbCu8YmrX7t8rLBaaNV1GfvhHz+/D2DZxrC3IrgF69TlMGjNUrGABvw4Li/Nu4OIQ0uNDUWmWRt0jqIXKxBB0K5ttOwWwxbVy3GntESsz8T5UwjXtiN6qA+vTlt3rQ1xvLTUroV/T/pCN/ZX5ldi9MI2fqTf3Cp9M8TLZ15pcrIG+b7/pm6/rWfJtVgtfu7L9FWf8XhTG/Mhcn5THT2PyrBtQ+GhBuvwYyjQYqafp7irUhzkh6YqrpitmkOXMttsU1zm6HVZTdmx0z6DMezmm4CT1EcbPmogJ320zDZxrMzz//zHz68u43hK/ML8ynL2/nnq9vOuaP1ET4xKDE/1bX/1dcfzDM/tNQvnWtCthvI/cfB/WPKa9h+Qrq9+hdGRoRPl0QfCfYy+l/KPjumjd58d1tfn8hfpnHqu7wQaBX3aXM3pDU/sAYi+Hij3GATj5O/vTEWFUjw35Vh7002eO86kdhUa2Hqs5ULTZnDgFOmANmCCoTL2jWPEQvSVF/g/Tt0fT1LfpVl/paZ3755a0JvyOI7+28zG64Mrcx9IbvMscZyjHzfnT+74LJcZxS/J7tkvtF6kWYFs3aD+a4u7SriNs766/vYX16fGDZygg1PTA0QJTBe5yfaHBprwVz/U9KmWP/zwxOijLHTJwmIa3OLl/SKq/fMP3Qngv1d25rNH6q/W8AAAD//wICZiueGgAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://logs.us-east-1.amazonaws.com/"
                      group_name = "staging_external"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "581214611" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZeZOjyJX/XxHzHVi5I9aONhKHUJXKUxMWEugEieQSeB2KBFICkRwFia6e/u4b6ChXVfe07d2N2Jj6RyLzXfze7+V7qRpkKUEpoY1Tjp6opMIkymFB2kl0RMFfKC+r0gAWp+emMlEkcWGqwz5wmo36ibZQUUZZ+kSxLeanxk8Nmn4r9FPjbnsYlXlWRuQiCwmBfpiglPyF2kQYpTBBz80ojUjL32yb/9AyCpiWG1TQUupnQZRun6gHLyJvBC4hE3QkbR9nVUD7WbqJtj81lChB3wT3h7cyjUZVoqJ8alAUTdURPFHI5+h6sUFRFFWW4RpWJMyK6IyCdYxOF9n6j6aaZRnSRQmpfr/fF3n1DAfsyeek+nHY1/piv98f9LXBcbeRJxM82gzSXuTj8SmxC0ksDJPD8y6J9ZHBovwhGCzPB3bndO001PBypeRoWUTqUV3h0aNvL3ptIOdiwJx78kE9fY4327C3qU6q0+lNPiuwuzgZlrgVQjWTjxuwGgnRmPhtXcOpJ8nRLNfjDo7yrKO5RCTJtv+yjfV+d3gOT1uvWwlKLzoak2PHFneVrjCjlXZWdznanCK7+lxOwOeQMwstnvXFqpo4mlfs8Gc5tBI43xf7k7HgqnJB9qkj7kJveTgtHjh7uYP5LGj3QgO+LCX2IJ+6psylK7+z3B6YbaR53TLyZOP8oBroaPOC1nt8ybWFrTgzP9+6BdbheDxzdSUk58WDErjFYi6bq0xn+6h/6mxD4qvFQjSwJ+j75QN/PjMvIpA5f7DoLJhDLhwOL8twf+BS4vG5MV+SAJHpZ0tgtGWap6uTrqduzp3lg4841lsduw9p2MNpOC/c7Q49+JmWLvvyse1jvivp09M2qpa+ePgcs49OhR1lZb5AkcSH6TwGu2G+M1YcEpQp282GD+V07HfathCfNvN9oJRWGLywg9V4ZFmL/JxtPaYnWE7EgJWcpy5os8jaDtrgs22diLNxHpliYy38oJ9xI3eTToWzA8zVdNpT3BimxyMvPZiLKJamaq80dxzDnLuD04mZbCYvhjdlRWHzsAl46INi3hn6jhnIkzYrnlS7K7O7B9+N+qPFdKZ655XMGDzZPB4ZxGrPz1QCd1nx1wIFISQtP0ua7/mOAk4Q2N6F84Mr57E7nLCqIQn12mQpsjsZd/KubIjRcWx0D4u4u3pMd233AWVLVZPaCnOYdR6FGZV5VQCjd84ahyIiaF2fCLeyzCEJn6g2SfJrea/rM2K9h0V5icy/ngJP1K+3QBe6aE7mw/VgoSgT4/mR9+HmkWGQwAlcx+uwnc3DRvA2AkRMwPs9lvMfe2yPu2kPFspyoUvgrv6wERDfDYJe55EVmA30Ox7Dd/mu3w34nuc9dBGHHtlg89F5fz2QgPE81xky19kBMIOpEYlDYE1N3XSnGiOb4LLHkEHMTnUTSJakDjXbXbmMzOvmVHQZbJlDVVM456xa4siMBdbjXAYlimAMYw6MQtPjgBgwANhmPvfYfArH7s6IZQDMw0zDshgw7guwLFWL8VgzZAuYMh8wx0hhhNyVg9Jn86G6cneerfL6KNwZMfuirYKlJVldwwIuMlnJMtQVHKkLY5WLwSGv9zrv9mJ5ZVhTEDBWapvANi1ZApLMBIly0ndyaPFhYYwYAVl5V2NU0WQwD2TZ1WOyt2OcBYm6GFxing5MU5ZcLpBNSZYusnZvWD9rsaxqqVjYluzolqo453Bu27lqWjhFqQgWpioq7HSuJMEEDMWjs5LPwW47c6zpzooVTsWK4MbhEZjmEZpHy5YeeWU4BWhnnSGXZwqfH40xHpu7kDexs59z6lSxJ0d/J1rIyg2HOUKF9XnLyk/aIWPUIUgcPjsbK9zxZLVrsZZrsmKqxXgOR4G4GMvEx7mu2L3EscEJjS3dGJCzF7uSbpOOwvuFc5ZnrmVVSqKWihzkA2wx9nA6Bqw7BDhQDU7euzEobNkagtSa6+NgZtrByBiDsy6p0LbVJMCBrcs5VONOJ2CCg4JlaBsTwTmHrLcSXxSrPzMlt7QlpeOOZGhIbGjLOAKGqOorYCuSOtFTkQcMPjgprjwLm96AnEFqcd4Q7K0Re0LjbI9WYdeXAGfF7NKP5amn5R2PK3kfW8QaWzEYWbLJTgcGF4iKSVjHZHVrbIX6SgTeeRp7vHucnftHkDhnzeycLFMVA8YSNVteWBI7AqtgYlpYGmBXV6TeQMNYBnHGu4brKHx8cEe90td7Mwe7uRPjPOBAZbL9Qo3ZwUIKRMWyYn0VANtkB44pj/RdgFW8PSNDjD3uMPsNXfGuC1aBrEU93jRdVTPZgWY7ne/X1fGVo9o2F0GacyqHsc74gifncz+enAybhVCSj7qEFWQfQ4PHtm/4PDjjgWFNTZCqBzs1GWU84QELeIcBWZBsWWCqe12Wo0FyLAJDdFSz57gM4OyxOvBHvZE+nnKKRJa6fTRU1popK+egjsq9jnFqj/3CG+WmNVb2i1V+8HahbiVH4o/NPWDYpWGYM9Oejs0BWcCdBf2zlQDGXUGpwxvGhDVtYi2G05k3DrEey6W5CicadxyaI6tjxqrqGLKgrvq8NRLSxVCc6zhgkCVqCy1nTC5QtbTPq5alu/Yjo5pmx5Tyk572z3CM96o87SysKQAcOSFb1fVVkGhxyEE+VPXErXxO4W29x6k2ZsEuJEhiu4OdyjhxJsyYXACmzOrj7OjEAeubqjPj5ZlpATMY9IB3dk5BHKwcMxZM1p07WOk4Vqho5+lCTeUdtKdHf2d23B2Q9Fib6alaGvoj749Vwd/Je3UFGCeeViqOWW2l9AbR9UwGpiBNJFU2MZiCGA81C8jXs5yZfewU44VuPEcpQUUKcaskcBul27qb5VmJilZWelWEg1ZWbD9q9odDIOn6M8u0eKbFPrZY9iZiL8BMAmtdn69nkqOv+0B9hkX6BA/lU4n8ApEygSncouKpKmkES0KzTz2efxA4tvfQ6/VuUk9egQ6XuZV+kE2E8M2+bor6AEyWxmShrpW+2h/dWl5fHf7PnZWVV/pFlNcTPn1Tof0sSWAa0LHm4Kx39+/ohqRcoFP7irReAkmerJ5v4NF3NOlDVsS3WfwNbsMJeG4j4rdv2NJ3sO/WpQGQDP31xSR1uFxMVGNtgvlzSEhePrXb+9xHNBOwPCt0eKYrdHoe6wd073wsHs7CvvX+zVuvb96qFVswgecshYeyTnT77aDyvbi+WWiRLMHfn1/+Fme76O+3B4hxdkDBOsgSGKUl9Uz9jWoSBJO3tGr+mWqGldeqc/1x/Qrgt1vU3YMPqWeq+f2ofUj7BWnlqB7MbtFdDf7b8f2fxfEB6T3ySVbcPn6EaplVhY/K1i6ramYFd7/klKPa8339Pu+io4+rAK2rNCKX92refJSo2Ec+av79FZIySuOylVXko014KNeXmfUAiR+ucbYt7+ajNK/IDa9X169goDTIsygltZH3fGURw7MeFBiehx7jCzR62W+z455r1dZ/zNK7722RVfm6vu7W9m81t77X3F2qJAWCyavYNYHr8lTibPsK0u1K3vKzAPkXGMssbTYaRZX6SXAd4MtTSVDiE0yhFHoYUTSdZgfqCucPfi74dy7+R7oMEcbX0+e3bv7/0faitO3BMmyUiFA0qjIqj3K0gRFuXPnx/XtG4w/UCBGKhIiK0pLA1EfUZNhqTFTd6KsDaT0ZPn/6o18VmKLnJVVn7KndZru9Fid0WrfPNoYElaSdIALpABLYvtuio+BPtY9+WaKkBijMSlLj3mrI5nz+eko+Nz99+f7B+ZX+9OVNMF+btbllUTMoq66Bp+jwxi7yw4xq6oiQKN3eMvS6TZGM+vTlneuvrYtJ/YbCB4VW4/6tznKJCP1q6tM7M7+PbN/AuTYzrwboNesko8BYvYIB0DYqCSre8+IQkfAi02hXZdHGmQ/xJRJ4KKn3PYXaIkJfl+g9xBWi/qsuGPpe/XRNqE9fftTNvt5UblaioJb/J739K/UrtXuh6IJqtvSLnk6KKN02qV+ugLxt4+tbrOtbG2/VBd64q/9IsvkvGqN+pS5JKhKK3vyrATS+N2rcflOkaBpWJPs9cW2IcpydqHpOozZZQV0P2/LKs9tmzbJ7R6QGfcpHBYk2kQ8JajU8WKJuh6IDiqZ+/vln6tOXD79EfKV+oT59eTtBfX3TVn/LTYxOFEyD977+v3j9nZn4n1L51rVqYN8z9x8bze9LXmn5Cuq36F0V6BidLgh+MOwX5H9p+J6aN3Xxzdv8/ih+Gdrq7vAdotfdpcrfiDT+QBmL4eKPSQhPAUr/9ETZdSNDQX0O+1m6R0Xdj6Kyfh6qOlW32II6hCilDojCsEr9sNXwIbkURfMN0rer19e36Ndd6muT+uWXtyH8jiC+t/Mqv+FK3WbVG77LAuWwQNTH+fo/S6pASUbQR7VL7ZeZHyNSthq/McfdrV1N3G5sf/0I69PjA8PUQajZgSIhJBTao+JEwkt7Lanr/2OqAgV/plBaVgWikiyNSL13+ZLVdf1G6TfjuUh/kzaa/qnx3wEAAP//UTNuXuQaAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                      group_name = "staging_internal"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "d3da00eef76c5086b070fe65de6b25fe5d87b2295804df95e364f02bfdc9333b" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://logs.us-east-1.amazonaws.com/"
                  group_name = "staging_external"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "7adeed9dad1c58985e93bcbf2a4946764e40e85a164d5612f24fced7ab3f34ce" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                  group_name = "staging_internal"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ ami                          = "ami-0cbbe767efb2654f9" -> "ami-0e8b18d21c1c2b2cf" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0236ce4e3ed3355c7" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0236ce4e3ed3355c7" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f8281078d6a9b424" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-0cbbe767efb2654f9" -> "ami-0e8b18d21c1c2b2cf" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-01651541b6ae90160" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-01651541b6ae90160" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-025fe5aa38d3449b9" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 16 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ image_id                = "ami-0cbbe767efb2654f9" -> "ami-0e8b18d21c1c2b2cf"
      ~ latest_version          = 16 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZaY/iyrn+jnT+gy8Z6SaaAF6Abjqnj4LBZrXBZZeNnRuhsl1g4/LSdpltzvz3K7N0enp6ThLlSlenv0BVvVs971r0IE0oTmjDOGX4iYlLQsMM5bQVh0fs/4Vx0zLxUX56risTRRIXUB32gV2vVauGifMiTJMnhmuyP9V+qjUab4l+qt1lD8MiS4uQXmgRpcgLYpzQvzCbkOAExfi5HiYhbXqbbf0fXEaOkmKD84aUeKkfJtsn5sEN6RuCi8kUH2nLI2npN7w02YTbn2pKGOPvjPvDW5parSxwXjzVGKbBVBY8MdjjG9VmjWEYpiiCNSppkObhGfvrCJ8utNVfg6kXRdDIC8T0+/2+KKhnNOBOHi9Vy2Ff64v9fn/Q1wbH3UaeTMhoM0h6oUfGp9jKJTE3IE/mXRrpI4PD2YM/WJ4P3M7uWkmgkeVKyfAyD9WjuiKjR89a9FpAzkSfPffkg3r6HG22QW9TnlS73Zt8VlB3cTJMcdsJ1FQ+bsBq1AnH1GvpGklcSQ5nmR61SZilbc2hIo23/ZdtpPe7w3Nw2rrdsqP0wqMxObYtcVfqCjtaaWd1l+HNKbTKz8UEfA54mGvRrC+W5cTW3HxHPsuBGaP5Pt+fjAVfFgu6T2xxF7jLw2nxwFvLHcpmfqsXGOhlKXEH+dSFMp+svPZye2C3oeZ2i9CVjfODauCjJXS03uNLpi0sxZ552dbJiY7G45mjKwE9Lx4U38kXcxmuUp3r4/6pvQ2op+YL0SBuR98vH4TzmX0Rgcx7g0V7wR6yzuHwsgz2Bz6hrpAZ8yX1MZ1+NjustkyyZHXS9cTJ+LN88DDPuatj9yEJeiQJ5rmz3eEHL9WSZV8+tjwidCV9etqG5dITD58j7tEuia2s4AsSaXSYziOwG2Y7Y8XjjjLluunwoZiOvXbL6kSnzXzvK4UZ+C/cYDUemeYiO6dbl+11TDtkwUrOEge0OGxuBy3w2TJP1N7Yj2y+MRee30/5kbNJpp2zDeBqOu0pToSS41GQHuAijKSp2ivgjmfZc3dwOrGTzeTFcKec2Nk8bHwBeSCft4eeDX150uLEk2p1ZW734Dlhf7SYzlT3vJJZQ6CbxyOLOe35mYnRLs3/mmM/QLTppXH923jHPt/pcL1LzA+uMU+c4YRTDalT7U2WIreTSTvryoYYHsdG97CIuqvHZNdyHnC6VDWppbCHWfuxM2NSt/RR+I2y2iEPKV5XFeGWlhmiwRPTonF2Te91VSPWe5QXF8u8axV4Yn69GbrQRTiZD9eDhaJMjOdHwUObR5bFHb7Dt9021948bDrupoMw6wtej+O9xx7X42/cg4WyXOgSuLM/bDpY6Pp+r/3IddgN8touK3SFrtf1hZ7rPnQxjx85f/NeeX89kIDxPNdZOte5AYD+1AjFITCnUIfOVGNlCC5nLB1E3FSHQDIldahZzsphZUGHU9FhiQmHqqbw9lk1xRGMOpzLOyyOlY4xjHgwCqDLA9FnAbBgNne5bIrGzs6IZADgYaYRWfRZ5wWYpqpFZKwZsgmgLPjsMVTYTubIfuFx2VBdOTvXUgV9FOyMiHvRVv7SlMyuYQIHQ04yDXWFRurCWGWif8iqs/Y3Z5G8Mswp8FkzsSCwoClLQJJZP1ZO+k4OTCHIjRHbwWbW1VhVhCwRgCw7ekT3VkRSP1YXg4vN0wGEsuTwvgwlWbrQWr1htdYiWdUSMbdM2dZNVbHPwdyyMhWaJMGJCBZQFRVuOldifwKG4tFeyWd/t53Z5nRnRgqvEqXjRMERQHhE8Gha0qOgDKcA78wz4rNUEbKjMSZjuAsESOz9nFenijU5ejvRxGZm2OwRKZwnmGZ20g4pqw5BbAvp2ViRtiurXZMzHciJiRaRORr54mIsU49kumL1YtsCJzw2dWNAz27kSLpF24rg5fZZnjmmWSqxWiiynw2IyVrD6RhwzhAQXzV4ee9EILdkcwgSc66P/Rm0/JExBmddUpFlqbFPfEuXM6RG7bbP+geFyMgyJh37HHDuSnxRzP4MSk5hSUrbGcnIkLjAkkkIDFHVV8BSJHWiJ6IAWHKwE1K6JoHugJ5BYvLuEOzNEXfC43SPV0HXkwBvRtzSi+Spq2Vtly8Ej5jUHJsRGJky5KYDg/dFBVLOhpxujs1AX4nAPU8jV3COs3P/CGL7rMH2yYSq6LOmqFnywpS4EVj5E2gSaUAcXZF6A40QGUSp4BiOrQjRwRn1Ck/vzWziZHZEMp8HJeT6uRpxg4Xki4ppRvrKBxbkBjaUR/rOJyrZnrEhRi5/mP2AV7zzgpUva2FPgNBRNcgNNMtuf5xXx9cY1baZCJKMV3lCdNbruHI296LJybA4hCT5qEtEwdYxMARieYYngDMZGOYUgkQ9WAlklfFEABwQbBakfrzlAFT3uiyHg/iY+4Zoq7BnOyzgrbE68Ea9kT6e8opEl7p1NFTOnCkr+6COir1OSGKNvdwdZdAcK/vFKju4u0A34yP1xnAPWG5pGHAGrekYDugC7Uzknc0YsM4KSW3BMCYctKi5GE5n7jggeiQXcBVMNP44hCOzDSNVtQ25o676gjnqJIuhONeJz2JT1BZaxkLeV7WkL6imqTvWI6tC2IZSdtKT/hmNyV6Vp+2FOQWApydsqbq+8mMtCngkBKoeO6XHK4Kl93jVIhzYBRRLXHewU1k7SjszNusAKHP6OD3akc95ULVngjyDJoD+oAfcs33yI39lw6gDOWduE6Vtm4GinacLNZF3yJoevR1sOzsg6ZE20xO1MPRHwRurHW8n79UVYO1oWqok4rSV0huE15oMYEeaSKoMCZiCiAw1E8jXWs7O3neK8UI3nvGR4jxBpFlQtA2TbdXNsrTAeTMt3DIkfjPNt+85+8MhkHT9mXvgmwLX7LabHHejsRZgJoG1rs/XM8nW132gPqM8eUKH4qnAXo5pEaMEbXH+VBYNjAra4J56gvDQ4bneQ6/Xu1E9FTjfhx6+zK6NCT8SrPSmQoeiPgCTpTFZqGulr/ZHt7bXV4f/gb7SLbw8zKopv3FjaXhpHKPEb0SaTdLeXb+tG5JygU/tK9J6CSR5snq+Adi4I9o4pHl0m8ffYDecgOcWpl7rhm/jDvhdujQAkqG/XkxSh8vFRDXWEMyfA0qz4qnV+vZmzdebNVGMzmmCDkXlx9bbOeQjld9tNGkak4/Hk79F6S78+22BCEkP2F/7aYzCpGCemb8xdYpR/DZq6n9m6kHpNt0cH97vX7H5/oi5a/AQ88zUP7baQw0vp80MV3PXzbqrwH/bvv8zO94hvcceTfPbx2+hWqRl7uGiuUvLKmj8u156ynCl+b5/H2fx0SOlj9dlEtLLveo3Hbd8qf/9FZIiTKKimZb0vUx0KNaXkfSAqBesSbot7uLDJCvpDa9X1a9g4MTP0jChlZB7KFbcPwzAu9htnpbZunqoVqy3TFnfM+VOVdAco/iV7OqbdXEqSLp9vf/tMd30Uh97F4SKNKnXanmZeLF/Hb2LU0Fx7FHC4AS5BDONRpIemCtSv/HQ/3ee7MdGEWBCrjXjR2/2/2q5YdJyURHUCkyZBi5TJgszvEEhqV1d//ELofYHZoQpQwPMhElBUeJhZjJs1iaqbvTVgbSeDJ8//dErc8I05gVTOeOp1eK6vSbfaTdvny2CKC5oK8YUNXxEUesuqxH6f6p09IsCxxVAQVrQCvdmTYbz+Wtte65/+vJxufva+PTljTFf65W4ZV4FR1peDU/w4Y1c7AUpU9cxpWGyvXno9ZihKfPpyzeqvzYvIvUbCu8YmrX7t8rLBaaNV1GfvhHz+/D2DZxrC3IrgF69TlMGjNUrGABvw4Li/Nu4OIQ0uNDUWmWRt0jqIXKxBB0K5ttOwWwxbVy3GntESsz8T5UwjXtiN6qA+vTlt3rQ1xvLTUroV/T/pCN/ZX5ldi9MI2fqTf3Cp9M8TLZ15pcrIG+b7/pm6/rWfJtVgtfu7L9FWf8XhTG/Mhcn5THT2PyrBtQ+GhBuvwYyjQYqafp7irUhzkh6YqrpitmkOXMttsU1zm6HVZTdmx0z6DMezmm4CT1EcbPmogJ320zDZxrMzz//zHz68u43hK/ML8ynL2/nnq9vOuaP1ET4xKDE/1bX/1dcfzDM/tNQvnWtCthvI/cfB/WPKa9h+Qrq9+hdGRoRPl0QfCfYy+l/KPjumjd58d1tfn8hfpnHqu7wQaBX3aXM3pDU/sAYi+Hij3GATj5O/vTEWFUjw35Vh7002eO86kdhUa2Hqs5ULTZnDgFOmANmCCoTL2jWPEQvSVF/g/Tt0fT1LfpVl/paZ3755a0JvyOI7+28zG64Mrcx9IbvMscZyjHzfnT+74LJcZxS/J7tkvtF6kWYFs3aD+a4u7SriNs766/vYX16fGDZygg1PTA0QJTBe5yfaHBprwVz/U9KmWP/zwxOijLHTJwmIa3OLl/SKq/fMP3Qngv1d25rNH6q/W8AAAD//wICZiueGgAA" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 14 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ image_id                = "ami-0cbbe767efb2654f9" -> "ami-0e8b18d21c1c2b2cf"
      ~ latest_version          = 14 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZeZOjyJX/XxHzHVi5I9aONhKHUJXKUxMWEugEieQSeB2KBFICkRwFia6e/u4b6ChXVfe07d2N2Jj6RyLzXfze7+V7qRpkKUEpoY1Tjp6opMIkymFB2kl0RMFfKC+r0gAWp+emMlEkcWGqwz5wmo36ibZQUUZZ+kSxLeanxk8Nmn4r9FPjbnsYlXlWRuQiCwmBfpiglPyF2kQYpTBBz80ojUjL32yb/9AyCpiWG1TQUupnQZRun6gHLyJvBC4hE3QkbR9nVUD7WbqJtj81lChB3wT3h7cyjUZVoqJ8alAUTdURPFHI5+h6sUFRFFWW4RpWJMyK6IyCdYxOF9n6j6aaZRnSRQmpfr/fF3n1DAfsyeek+nHY1/piv98f9LXBcbeRJxM82gzSXuTj8SmxC0ksDJPD8y6J9ZHBovwhGCzPB3bndO001PBypeRoWUTqUV3h0aNvL3ptIOdiwJx78kE9fY4327C3qU6q0+lNPiuwuzgZlrgVQjWTjxuwGgnRmPhtXcOpJ8nRLNfjDo7yrKO5RCTJtv+yjfV+d3gOT1uvWwlKLzoak2PHFneVrjCjlXZWdznanCK7+lxOwOeQMwstnvXFqpo4mlfs8Gc5tBI43xf7k7HgqnJB9qkj7kJveTgtHjh7uYP5LGj3QgO+LCX2IJ+6psylK7+z3B6YbaR53TLyZOP8oBroaPOC1nt8ybWFrTgzP9+6BdbheDxzdSUk58WDErjFYi6bq0xn+6h/6mxD4qvFQjSwJ+j75QN/PjMvIpA5f7DoLJhDLhwOL8twf+BS4vG5MV+SAJHpZ0tgtGWap6uTrqduzp3lg4841lsduw9p2MNpOC/c7Q49+JmWLvvyse1jvivp09M2qpa+ePgcs49OhR1lZb5AkcSH6TwGu2G+M1YcEpQp282GD+V07HfathCfNvN9oJRWGLywg9V4ZFmL/JxtPaYnWE7EgJWcpy5os8jaDtrgs22diLNxHpliYy38oJ9xI3eTToWzA8zVdNpT3BimxyMvPZiLKJamaq80dxzDnLuD04mZbCYvhjdlRWHzsAl46INi3hn6jhnIkzYrnlS7K7O7B9+N+qPFdKZ655XMGDzZPB4ZxGrPz1QCd1nx1wIFISQtP0ua7/mOAk4Q2N6F84Mr57E7nLCqIQn12mQpsjsZd/KubIjRcWx0D4u4u3pMd233AWVLVZPaCnOYdR6FGZV5VQCjd84ahyIiaF2fCLeyzCEJn6g2SfJrea/rM2K9h0V5icy/ngJP1K+3QBe6aE7mw/VgoSgT4/mR9+HmkWGQwAlcx+uwnc3DRvA2AkRMwPs9lvMfe2yPu2kPFspyoUvgrv6wERDfDYJe55EVmA30Ox7Dd/mu3w34nuc9dBGHHtlg89F5fz2QgPE81xky19kBMIOpEYlDYE1N3XSnGiOb4LLHkEHMTnUTSJakDjXbXbmMzOvmVHQZbJlDVVM456xa4siMBdbjXAYlimAMYw6MQtPjgBgwANhmPvfYfArH7s6IZQDMw0zDshgw7guwLFWL8VgzZAuYMh8wx0hhhNyVg9Jn86G6cneerfL6KNwZMfuirYKlJVldwwIuMlnJMtQVHKkLY5WLwSGv9zrv9mJ5ZVhTEDBWapvANi1ZApLMBIly0ndyaPFhYYwYAVl5V2NU0WQwD2TZ1WOyt2OcBYm6GFxing5MU5ZcLpBNSZYusnZvWD9rsaxqqVjYluzolqo453Bu27lqWjhFqQgWpioq7HSuJMEEDMWjs5LPwW47c6zpzooVTsWK4MbhEZjmEZpHy5YeeWU4BWhnnSGXZwqfH40xHpu7kDexs59z6lSxJ0d/J1rIyg2HOUKF9XnLyk/aIWPUIUgcPjsbK9zxZLVrsZZrsmKqxXgOR4G4GMvEx7mu2L3EscEJjS3dGJCzF7uSbpOOwvuFc5ZnrmVVSqKWihzkA2wx9nA6Bqw7BDhQDU7euzEobNkagtSa6+NgZtrByBiDsy6p0LbVJMCBrcs5VONOJ2CCg4JlaBsTwTmHrLcSXxSrPzMlt7QlpeOOZGhIbGjLOAKGqOorYCuSOtFTkQcMPjgprjwLm96AnEFqcd4Q7K0Re0LjbI9WYdeXAGfF7NKP5amn5R2PK3kfW8QaWzEYWbLJTgcGF4iKSVjHZHVrbIX6SgTeeRp7vHucnftHkDhnzeycLFMVA8YSNVteWBI7AqtgYlpYGmBXV6TeQMNYBnHGu4brKHx8cEe90td7Mwe7uRPjPOBAZbL9Qo3ZwUIKRMWyYn0VANtkB44pj/RdgFW8PSNDjD3uMPsNXfGuC1aBrEU93jRdVTPZgWY7ne/X1fGVo9o2F0GacyqHsc74gifncz+enAybhVCSj7qEFWQfQ4PHtm/4PDjjgWFNTZCqBzs1GWU84QELeIcBWZBsWWCqe12Wo0FyLAJDdFSz57gM4OyxOvBHvZE+nnKKRJa6fTRU1popK+egjsq9jnFqj/3CG+WmNVb2i1V+8HahbiVH4o/NPWDYpWGYM9Oejs0BWcCdBf2zlQDGXUGpwxvGhDVtYi2G05k3DrEey6W5CicadxyaI6tjxqrqGLKgrvq8NRLSxVCc6zhgkCVqCy1nTC5QtbTPq5alu/Yjo5pmx5Tyk572z3CM96o87SysKQAcOSFb1fVVkGhxyEE+VPXErXxO4W29x6k2ZsEuJEhiu4OdyjhxJsyYXACmzOrj7OjEAeubqjPj5ZlpATMY9IB3dk5BHKwcMxZM1p07WOk4Vqho5+lCTeUdtKdHf2d23B2Q9Fib6alaGvoj749Vwd/Je3UFGCeeViqOWW2l9AbR9UwGpiBNJFU2MZiCGA81C8jXs5yZfewU44VuPEcpQUUKcaskcBul27qb5VmJilZWelWEg1ZWbD9q9odDIOn6M8u0eKbFPrZY9iZiL8BMAmtdn69nkqOv+0B9hkX6BA/lU4n8ApEygSncouKpKmkES0KzTz2efxA4tvfQ6/VuUk9egQ6XuZV+kE2E8M2+bor6AEyWxmShrpW+2h/dWl5fHf7PnZWVV/pFlNcTPn1Tof0sSWAa0LHm4Kx39+/ohqRcoFP7irReAkmerJ5v4NF3NOlDVsS3WfwNbsMJeG4j4rdv2NJ3sO/WpQGQDP31xSR1uFxMVGNtgvlzSEhePrXb+9xHNBOwPCt0eKYrdHoe6wd073wsHs7CvvX+zVuvb96qFVswgecshYeyTnT77aDyvbi+WWiRLMHfn1/+Fme76O+3B4hxdkDBOsgSGKUl9Uz9jWoSBJO3tGr+mWqGldeqc/1x/Qrgt1vU3YMPqWeq+f2ofUj7BWnlqB7MbtFdDf7b8f2fxfEB6T3ySVbcPn6EaplVhY/K1i6ramYFd7/klKPa8339Pu+io4+rAK2rNCKX92refJSo2Ec+av79FZIySuOylVXko014KNeXmfUAiR+ucbYt7+ajNK/IDa9X169goDTIsygltZH3fGURw7MeFBiehx7jCzR62W+z455r1dZ/zNK7722RVfm6vu7W9m81t77X3F2qJAWCyavYNYHr8lTibPsK0u1K3vKzAPkXGMssbTYaRZX6SXAd4MtTSVDiE0yhFHoYUTSdZgfqCucPfi74dy7+R7oMEcbX0+e3bv7/0faitO3BMmyUiFA0qjIqj3K0gRFuXPnx/XtG4w/UCBGKhIiK0pLA1EfUZNhqTFTd6KsDaT0ZPn/6o18VmKLnJVVn7KndZru9Fid0WrfPNoYElaSdIALpABLYvtuio+BPtY9+WaKkBijMSlLj3mrI5nz+eko+Nz99+f7B+ZX+9OVNMF+btbllUTMoq66Bp+jwxi7yw4xq6oiQKN3eMvS6TZGM+vTlneuvrYtJ/YbCB4VW4/6tznKJCP1q6tM7M7+PbN/AuTYzrwboNesko8BYvYIB0DYqCSre8+IQkfAi02hXZdHGmQ/xJRJ4KKn3PYXaIkJfl+g9xBWi/qsuGPpe/XRNqE9fftTNvt5UblaioJb/J739K/UrtXuh6IJqtvSLnk6KKN02qV+ugLxt4+tbrOtbG2/VBd64q/9IsvkvGqN+pS5JKhKK3vyrATS+N2rcflOkaBpWJPs9cW2IcpydqHpOozZZQV0P2/LKs9tmzbJ7R6QGfcpHBYk2kQ8JajU8WKJuh6IDiqZ+/vln6tOXD79EfKV+oT59eTtBfX3TVn/LTYxOFEyD977+v3j9nZn4n1L51rVqYN8z9x8bze9LXmn5Cuq36F0V6BidLgh+MOwX5H9p+J6aN3Xxzdv8/ih+Gdrq7vAdotfdpcrfiDT+QBmL4eKPSQhPAUr/9ETZdSNDQX0O+1m6R0Xdj6Kyfh6qOlW32II6hCilDojCsEr9sNXwIbkURfMN0rer19e36Ndd6muT+uWXtyH8jiC+t/Mqv+FK3WbVG77LAuWwQNTH+fo/S6pASUbQR7VL7ZeZHyNSthq/McfdrV1N3G5sf/0I69PjA8PUQajZgSIhJBTao+JEwkt7Lanr/2OqAgV/plBaVgWikiyNSL13+ZLVdf1G6TfjuUh/kzaa/qnx3wEAAP//UTNuXuQaAAA=" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.rpmrepo_s3 will be created
  + resource "aws_s3_bucket" "rpmrepo_s3" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "rpmrepo.storage.staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "RPMrepo Storage - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_policy.rpmrepo_s3 will be created
  + resource "aws_s3_bucket_policy" "rpmrepo_s3" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210210185039611000000004" -> (known after apply)
      ~ id                                  = "sfr-3ad4c7b3-c385-4829-a6e3-c8cac094dfd8" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "16" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210210185002891400000002" -> (known after apply)
      ~ id                                  = "sfr-4f2febf1-e208-45df-b1ae-ec99e390367c" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "14" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-622835329" -> (known after apply)
      ~ instance_id = "i-0236ce4e3ed3355c7" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-652200567" -> (known after apply)
      ~ instance_id = "i-01651541b6ae90160" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.internal_vpc_rpmrepo will be created
  + resource "aws_vpc_endpoint" "internal_vpc_rpmrepo" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-084607083aaa39727",
          + "sg-0eb65fd8f2c17dba5",
        ]
      + service_name          = "com.amazonaws.us-east-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-04a176042c3118735",
          + "subnet-0e4e3490fbe18253b",
        ]
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "📸 RPMrepo Snapshots S3 endpoint (internal)"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-06d6127910664367d"
    }

Plan: 9 to add, 2 to change, 6 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-PR-11-testing-only (ami-0cbbe767efb2654f9)" -> "RHEL 8 pre-built: imagebuilder-service-image-20210211190435 (ami-0e8b18d21c1c2b2cf)"
```

</details>

*Pusher: @dvdhrm, Action: `pull_request`*